status/2022/0812.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>06 August 2022 - 12 August 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">06 August 2022 - 12 August 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3bd8dd6">1. MIT OCW</a>
<ul>
<li><a href="#orgd22ee04">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org0ed484c">1.1.1. Session 74-77</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf4e4605">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#orgc17d624">2.1. Fixed switch by removing broken wafer (1 of 2)</a></li>
</ul>
</li>
<li><a href="#orgf00f28c">3. Mill Controller #2</a>
<ul>
<li><a href="#org078a962">3.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#org5f8c95b">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org9198dea">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org29ab435">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc848fbf">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org7525e3c">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#orgb924b26">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org3263e41">5. OLPC</a>
<ul>
<li><a href="#org04a3a67">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org4318a50">6. Virtual Orchestra</a>
<ul>
<li><a href="#orgd6d4535">6.1. sfz file tests</a>
<ul>
<li><a href="#org16c90c8">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org533448e">7. gat</a>
<ul>
<li><a href="#org4851613">7.1. spectrogram partially complete</a></li>
</ul>
</li>
<li><a href="#org1053fcb">8. abby</a>
<ul>
<li><a href="#orge27dc3f">8.1. installed three wire chassis fan - too noisy</a></li>
<li><a href="#orgfc517c5">8.2. need to get 4 wire chassis fan</a></li>
</ul>
</li>
<li><a href="#org709ad59">9. More project ideas</a>
<ul>
<li><a href="#orgca6282a">9.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org8ca8ef3">9.2. GMPForth ports to SIMH</a>
<ul>
<li><a href="#orgb581880">9.2.1. SIMH maybe some targets (vax)</a></li>
<li><a href="#org8e4781c">9.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#orgeea421c">9.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org363c074">9.3. GMPASM assembler</a></li>
<li><a href="#org53a848d">9.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org542442e">9.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgac54ce5">9.5.1. Offline compilation</a></li>
<li><a href="#orgaf81ce6">9.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org48636cf">9.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org12bb49f">9.6.1. RTX2000, CDP1802 still in production!</a></li>
<li><a href="#org5a4caad">9.6.2. 6502, 68000, 320C30, others on hand</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7c629b3">10. David Davies</a>
<ul>
<li><a href="#orgd8f9f3a">10.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org786b08f">10.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgbbb21a4">10.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#org7c7083c">11. Peter Kim</a>
<ul>
<li><a href="#org7d9dcab">11.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org5a49a46">11.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org4162823">11.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#org732b7e3">11.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3bd8dd6" class="outline-2">
<h2 id="org3bd8dd6"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd22ee04" class="outline-3">
<h3 id="orgd22ee04"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org0ed484c" class="outline-4">
<h4 id="org0ed484c"><span class="section-number-4">1.1.1.</span> Session 74-77</h4>
</div>
</div>
</div>
<div id="outline-container-orgf4e4605" class="outline-2">
<h2 id="orgf4e4605"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc17d624" class="outline-3">
<h3 id="orgc17d624"><span class="section-number-3">2.1.</span> Fixed switch by removing broken wafer (1 of 2)</h3>
</div>
</div>
<div id="outline-container-orgf00f28c" class="outline-2">
<h2 id="orgf00f28c"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org078a962" class="outline-3">
<h3 id="org078a962"><span class="section-number-3">3.1.</span> Repurpose 'boss' hard drive</h3>
</div>
<div id="outline-container-org5f8c95b" class="outline-3">
<h3 id="org5f8c95b"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org9198dea" class="outline-4">
<h4 id="org9198dea"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org29ab435" class="outline-4">
<h4 id="org29ab435"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc848fbf" class="outline-2">
<h2 id="orgc848fbf"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7525e3c" class="outline-3">
<h3 id="org7525e3c"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-orgb924b26" class="outline-3">
<h3 id="orgb924b26"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org3263e41" class="outline-2">
<h2 id="org3263e41"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org04a3a67" class="outline-3">
<h3 id="org04a3a67"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org4318a50" class="outline-2">
<h2 id="org4318a50"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd6d4535" class="outline-3">
<h3 id="orgd6d4535"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org16c90c8" class="outline-4">
<h4 id="org16c90c8"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
</div>
<div id="outline-container-org533448e" class="outline-2">
<h2 id="org533448e"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4851613" class="outline-3">
<h3 id="org4851613"><span class="section-number-3">7.1.</span> spectrogram partially complete</h3>
</div>
</div>
<div id="outline-container-org1053fcb" class="outline-2">
<h2 id="org1053fcb"><span class="section-number-2">8.</span> abby</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orge27dc3f" class="outline-3">
<h3 id="orge27dc3f"><span class="section-number-3">8.1.</span> installed three wire chassis fan - too noisy</h3>
</div>
<div id="outline-container-orgfc517c5" class="outline-3">
<h3 id="orgfc517c5"><span class="section-number-3">8.2.</span> need to get 4 wire chassis fan</h3>
</div>
</div>
<div id="outline-container-org709ad59" class="outline-2">
<h2 id="org709ad59"><span class="section-number-2">9.</span> More project ideas</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgca6282a" class="outline-3">
<h3 id="orgca6282a"><span class="section-number-3">9.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-org8ca8ef3" class="outline-3">
<h3 id="org8ca8ef3"><span class="section-number-3">9.2.</span> GMPForth ports to SIMH</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgb581880" class="outline-4">
<h4 id="orgb581880"><span class="section-number-4">9.2.1.</span> SIMH maybe some targets (vax)</h4>
</div>
<div id="outline-container-org8e4781c" class="outline-4">
<h4 id="org8e4781c"><span class="section-number-4">9.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-9-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-orgeea421c" class="outline-4">
<h4 id="orgeea421c"><span class="section-number-4">9.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org363c074" class="outline-3">
<h3 id="org363c074"><span class="section-number-3">9.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-9-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org53a848d" class="outline-3">
<h3 id="org53a848d"><span class="section-number-3">9.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org542442e" class="outline-3">
<h3 id="org542442e"><span class="section-number-3">9.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-orgac54ce5" class="outline-4">
<h4 id="orgac54ce5"><span class="section-number-4">9.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-orgaf81ce6" class="outline-4">
<h4 id="orgaf81ce6"><span class="section-number-4">9.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org48636cf" class="outline-3">
<h3 id="org48636cf"><span class="section-number-3">9.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-9-6">
</div>
<div id="outline-container-org12bb49f" class="outline-4">
<h4 id="org12bb49f"><span class="section-number-4">9.6.1.</span> RTX2000, CDP1802 still in production!</h4>
</div>
<div id="outline-container-org5a4caad" class="outline-4">
<h4 id="org5a4caad"><span class="section-number-4">9.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
</div>
</div>
<div id="outline-container-org7c629b3" class="outline-2">
<h2 id="org7c629b3"><span class="section-number-2">10.</span> David Davies</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgd8f9f3a" class="outline-3">
<h3 id="orgd8f9f3a"><span class="section-number-3">10.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org786b08f" class="outline-3">
<h3 id="org786b08f"><span class="section-number-3">10.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgbbb21a4" class="outline-3">
<h3 id="orgbbb21a4"><span class="section-number-3">10.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-org7c7083c" class="outline-2">
<h2 id="org7c7083c"><span class="section-number-2">11.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org7d9dcab" class="outline-3">
<h3 id="org7d9dcab"><span class="section-number-3">11.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org5a49a46" class="outline-3">
<h3 id="org5a49a46"><span class="section-number-3">11.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org4162823" class="outline-3">
<h3 id="org4162823"><span class="section-number-3">11.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-org732b7e3" class="outline-3">
<h3 id="org732b7e3"><span class="section-number-3">11.4.</span> Sentencing 9/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>